In [4]:
# Instalação das bibliotecas
import numpy as np
import pandas as pd

In [3]:
check = pd.Series(['alex','matthew','john','romain'])
check

0       alex
1    matthew
2       john
3     romain
dtype: object

In [4]:
check.map(lambda x:len(x))

0    4
1    7
2    4
3    6
dtype: int64

In [ ]:
#Series: one dim
# Dataframe: 2 dim, tabular/sql table/ csv or excel table etc

In [5]:
dt = pd.DataFrame()
dt

Empty DataFrame
Columns: []
Index: []

In [6]:
dt1 = [5,3,7,6,5,4]
dt2 = pd.DataFrame(dt1)
dt2

   0
0  5
1  3
2  7
3  6
4  5
5  4

In [7]:
data = [['alex',30],['matthew',45],['romain',56]]
dt3 = pd.DataFrame(data,columns=['name','age'])
dt3

      name  age
0     alex   30
1  matthew   45
2   romain   56

In [18]:
data = {'name':['tom', 'alan', 'jack', 'rosy','jess','lilly','mak'], 'age':[34,76,35,67,12,45,76]}
dt4 = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4','rank5','rank6','rank7'])
dt4

        name  age
rank1    tom   34
rank2   alan   76
rank3   jack   35
rank4   rosy   67
rank5   jess   12
rank6  lilly   45
rank7    mak   76

In [11]:
#dataframes attributes
dt4.index

Index(['rank1', 'rank2', 'rank3', 'rank4'], dtype='object')

In [12]:
dt4.columns

Index(['name', 'age'], dtype='object')

In [13]:
dt4.dtypes

name    object
age      int64
dtype: object

In [19]:
dt4.shape

(7, 2)

In [20]:
dt4.head()

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   35
rank4  rosy   67
rank5  jess   12

In [21]:
dt4.head(3)

       name  age
rank1   tom   34
rank2  alan   76
rank3  jack   35

In [23]:
dt4.tail()

        name  age
rank3   jack   35
rank4   rosy   67
rank5   jess   12
rank6  lilly   45
rank7    mak   76

In [24]:
dt4.tail(2)

        name  age
rank6  lilly   45
rank7    mak   76

In [25]:
dt4[2:5] #Last range will be excluded Last-1 (5-1=4)

       name  age
rank3  jack   35
rank4  rosy   67
rank5  jess   12

In [26]:
dt4['name'] #Extract column from df

rank1      tom
rank2     alan
rank3     jack
rank4     rosy
rank5     jess
rank6    lilly
rank7      mak
Name: name, dtype: object

In [27]:
#another way
dt4.name

rank1      tom
rank2     alan
rank3     jack
rank4     rosy
rank5     jess
rank6    lilly
rank7      mak
Name: name, dtype: object

In [30]:
df = pd.DataFrame(np.random.randint(0,50,20).reshape(5,4),index=list('abcde'),columns=list('pqrs'))
df

    p   q   r   s
a  47   5  34   2
b   9  27  13  16
c   2  46  16  11
d  36   6   3  26
e  25   9  47  23